# Taps
# Only keep the non-standard tap
tap 'nicoverbruggen/homebrew-cask'

# Install Binaries
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gh'
brew 'grep'
brew 'httpie'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'tree'

# Development
brew 'composer'
brew 'node'
brew 'yarn'

# Apps
cask 'bartender'
cask 'brave-browser'
cask 'cleanshot'
cask 'elgato-wave-link'
cask 'elgato-stream-deck'
cask 'elgato-control-center'
cask 'firefox'
cask 'gifox'
cask 'google-chrome'
cask 'herd'
cask 'imageoptim'
cask 'hyper'
cask 'iterm2'
cask 'phpstorm'
cask 'ray'
cask 'raycast'
cask 'screenflow'
cask 'skype'
cask 'sublime-text'
cask 'tableplus'
cask 'tinkerwell'
cask 'transmit'
cask 'tuple'
cask 'vlc'
cask 'zoom'

# Fonts
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-lato'
cask 'font-jetbrains-mono'
cask 'font-bitter'

# Install Mac App Store apps
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id:409201541
mas 'The Unarchiver', id: 425424353
mas 'Unsplash Wallpapers', id: 1284863847
